In [5]:
import mariadb

In [6]:
cn = mariadb.connect(
    user = "root",
    password = "root",
    host="127.0.0.1",
    port = 3306,
    database = "cis660"
)

In [7]:
cr = cn.cursor()

In [8]:
cr.execute('''CREATE TABLE COMPANY
            (ID INT PRIMARY KEY     NOT NULL,
            NAME           TEXT    NOT NULL,
            AGE            INT     NOT NULL,
            ADDRESS        CHAR(50),
            SALARY         REAL);''')

In [10]:
cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

cr.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

In [22]:
cn.commit()

In [32]:
cr.execute("SELECT id, name, address, salary from COMPANY")

for row in cr:
    #print(row)
    print(row[1], row[3])

Allen 15000.0
Teddy 20000.0
Mark 65000.0

In [29]:
cr.execute("update company set Salary = 40000 where name='Paul'")
cn.commit()

In [31]:
cr.execute("delete from company where name='Paul'")
cn.commit()

In [ ]:
#import mysql.connector